src/cfe/DataProcessors/кбп_ПанельАдминистратора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>кбп_ПанельАдминистратора</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cfe/InformationRegisters/кбп_ОчередьДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кбп_ОчередьДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ВидыОтложенныхДействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Процессы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдМаркера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Задачи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполнитьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_СтатусыОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Попыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследняяОшибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/кбп_ОчередьОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кбп_ОчередьОповещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_СобытияПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоHTML</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Процессы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Задачи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючДедупликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_СтатусыОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Попыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправитьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Enums/кбп_СостоянияПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_СостоянияПроцессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прерван</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_ТипыШагов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_ТипыШагов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вариант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Таймер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оповещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декорация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_СостоянияЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переадресована</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_СтатусыОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_СтатусыОчереди</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетГруппировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Catalogs/кбп_Процессы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>кбп_Процессы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_СхемыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияСхемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ВерсииСхем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_СостоянияПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСтарта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительскийПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Процессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШагРодителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдМаркераРодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорневойПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_Процессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньВложенности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Переменные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Переменная</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.кбп_ПеременныеПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.кбп_ПеременныеПроцессов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/DataProcessors/кбп_ПанельАдминистратора/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не кбп_АдаптерКонфигурации.ЭтоАдминистраторПроцессов() Тогда
		ВызватьИсключение НСтр("ru = 'Панель доступна только администратору процессов.'");
	КонецЕсли;

	Список = Элементы.ВидСписка.СписокВыбора;
	Для Каждого Вид Из ВидыСписка() Цикл
		Список.Добавить(Вид);
	КонецЦикла;
	ВидСписка = ВидыСписка()[0];

	Список = Элементы.ОтборОповещений.СписокВыбора;
	Список.Добавить("Ошибки", НСтр("ru = 'С ошибками'"));
	Список.Добавить("НеОтправлено", НСтр("ru = 'Не отправленные'"));
	Список.Добавить("ЗаСутки", НСтр("ru = 'Все за сутки'"));
	ОтборОповещений = "Ошибки";

	Для Каждого Календарь Из кбп_АдаптерКонфигурации.ПроизводственныеКалендари() Цикл
		Элементы.ПроизводственныйКалендарь.СписокВыбора.Добавить(Календарь.Значение, Календарь.Представление);
	КонецЦикла;
	Элементы.ПроизводственныйКалендарь.Доступность = Элементы.ПроизводственныйКалендарь.СписокВыбора.Количество() > 0;

	ПрочитатьНастройки();
	ОбновитьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РассылкиПриИзменении(Элемент)
	УстановитьДоступностьРассылок();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПроцессы

&НаКлиенте
Процедура ПроцессыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьПроцесс(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура ПроцессыПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ПоказатьВыбранныйПроцесс", 0.2, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОшибкиДействий

&НаКлиенте
Процедура ОшибкиДействийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ОшибкиДействий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Поле = Элементы.ОшибкиДействийПоследняяОшибка И ЗначениеЗаполнено(ТекущиеДанные.ПоследняяОшибка) Тогда
		ПоказатьПредупреждение(, ТекущиеДанные.ПоследняяОшибка);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Процесс) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Процесс);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОповещения

&НаКлиенте
Процедура ОповещенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Оповещения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Поле = Элементы.ОповещенияОшибка И ЗначениеЗаполнено(ТекущиеДанные.Ошибка) Тогда
		ПоказатьПредупреждение(, ТекущиеДанные.Ошибка);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Задача) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Задача);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Процесс) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Процесс);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроцесс(Команда)

	ТекущиеДанные = Элементы.Процессы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанные.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриостановитьПроцесс(Команда)
	ВыполнитьДействиеСПроцессом("Приостановить");
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПроцесс(Команда)
	ВыполнитьДействиеСПроцессом("Продолжить");
КонецПроцедуры

&НаКлиенте
Процедура ПерезапуститьШаг(Команда)

	Если Элементы.Маркеры.ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите в таблице «Где сейчас» шаг, который нужно перезапустить.'"));
		Возврат;
	КонецЕсли;
	ВыполнитьДействиеСПроцессом("ПерезапуститьШаг", Элементы.Маркеры.ТекущиеДанные.ИдМаркера);

КонецПроцедуры

&НаКлиенте
Процедура ПеревестиНаШаг(Команда)

	Если Не ЗначениеЗаполнено(НовыйШаг) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите шаг в поле «Перевести на шаг».'"));
		Возврат;
	КонецЕсли;
	ИдМаркера = "";
	Если Маркеры.Количество() > 1 Тогда
		Если Элементы.Маркеры.ТекущиеДанные = Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'У процесса несколько веток: выберите в таблице «Где сейчас», какую перевести.'"));
			Возврат;
		КонецЕсли;
		ИдМаркера = Элементы.Маркеры.ТекущиеДанные.ИдМаркера;
	ИначеЕсли Маркеры.Количество() = 1 Тогда
		ИдМаркера = Маркеры[0].ИдМаркера;
	КонецЕсли;
	ВыполнитьДействиеСПроцессом("ПеревестиНаШаг", ИдМаркера);

КонецПроцедуры

&НаКлиенте
Процедура ПрерватьПроцесс(Команда)

	Если Не ЗначениеЗаполнено(ТекущийПроцесс) Тогда
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ПрерватьПроцессЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, СтрШаблон(НСтр("ru = 'Прервать процесс «%1»? Его задачи будут отменены.'"), ТекущийПроцесс),
		РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);

КонецПроцедуры

&НаКлиенте
Процедура ПовторитьДействие(Команда)
	ИзменитьДействие(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьДействие(Команда)
	ИзменитьДействие(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьОтправку(Команда)
	ИзменитьОчередьОповещений(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтправку(Команда)
	ИзменитьОчередьОповещений(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСейчас(Команда)

	ОтправитьОчередьНаСервере();
	ПоказатьОповещениеПользователя(НСтр("ru = 'Очередь оповещений обработана'"));

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)

	Если ОкончаниеРабочегоДня <= НачалоРабочегоДня Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Окончание рабочего дня должно быть позже начала.'"));
		Возврат;
	КонецЕсли;
	ЗаписатьНастройкиНаСервере();
	ПоказатьОповещениеПользователя(НСтр("ru = 'Настройки записаны'"));

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьРассылки(Команда)

	Отправлено = ОтправитьРассылкиНаСервере();
	ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru = 'Поставлено в очередь сообщений: %1'"), Отправлено), ,
		?(Отправлено = 0, НСтр("ru = 'Включите сводку или отчёт; сводка уходит тем, у кого есть задачи.'"), ""));

КонецПроцедуры

&НаКлиенте
Процедура ВключитьЗадания(Команда)
	ВключитьЗаданияНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Процессы

&НаКлиенте
Процедура ПоказатьВыбранныйПроцесс()

	ТекущиеДанные = Элементы.Процессы.ТекущиеДанные;
	Процесс = ?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.Ссылка);
	Если Процесс <> ТекущийПроцесс Тогда
		ЗагрузитьВыбранныйПроцесс(Процесс);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеСПроцессом(Действие, ИдМаркера = "")

	Если Не ЗначениеЗаполнено(ТекущийПроцесс) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите процесс в списке.'"));
		Возврат;
	КонецЕсли;
	Ошибка = ДействиеСПроцессомНаСервере(Действие, ИдМаркера);
	Если ЗначениеЗаполнено(Ошибка) Тогда
		ПоказатьПредупреждение(, Ошибка);
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru = 'Выполнено'"), ПолучитьНавигационнуюСсылку(ТекущийПроцесс),
			Строка(ТекущийПроцесс));
		ОповеститьОбИзменении(ТекущийПроцесс);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрерватьПроцессЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполнитьДействиеСПроцессом("Прервать");
	КонецЕсли;

КонецПроцедуры

// Возвращает текст ошибки или пустую строку; после действия списки перечитываются.
&НаСервере
Функция ДействиеСПроцессомНаСервере(Действие, ИдМаркера)

	Ошибка = "";
	Попытка
		Если Действие = "Приостановить" Тогда
			кбп_Движок.ПриостановитьПроцесс(ТекущийПроцесс, Комментарий);
		ИначеЕсли Действие = "Продолжить" Тогда
			кбп_Движок.ПродолжитьПроцесс(ТекущийПроцесс, Комментарий);
		ИначеЕсли Действие = "ПерезапуститьШаг" Тогда
			кбп_Движок.ПерезапуститьШаг(ТекущийПроцесс, ИдМаркера, Комментарий);
		ИначеЕсли Действие = "ПеревестиНаШаг" Тогда
			кбп_Движок.ПеревестиНаШаг(ТекущийПроцесс, ИдМаркера, НовыйШаг, Комментарий);
		ИначеЕсли Действие = "Прервать" Тогда
			кбп_Движок.ПрерватьПроцесс(ТекущийПроцесс, Комментарий);
		КонецЕсли;
		Комментарий = "";
		НовыйШаг = Неопределено;
	Исключение
		Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	Процесс = ТекущийПроцесс;
	ОбновитьНаСервере();
	ЗагрузитьВыбранныйПроцесс(Процесс);
	Возврат Ошибка;

КонецФункции

&НаСервере
Процедура ЗагрузитьВыбранныйПроцесс(Процесс)

	ТекущийПроцесс = Процесс;
	Маркеры.Очистить();
	СписокШагов = Элементы.НовыйШаг.СписокВыбора;
	СписокШагов.Очистить();
	Если Не ЗначениеЗаполнено(Процесс) Тогда
		ЗаголовокВыбранного = НСтр("ru = 'Выбранный процесс'");
		Элементы.ГруппаВыбранный.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	Элементы.ГруппаВыбранный.Доступность = Истина;
	ЗаголовокВыбранного = СтрШаблон(НСтр("ru = 'Выбранный процесс: %1 (%2)'"), Процесс, Процесс.Состояние);
	Для Каждого СтрокаМаркера Из кбп_Движок.МаркерыПроцесса(Процесс) Цикл
		ЗаполнитьЗначенияСвойств(Маркеры.Добавить(), СтрокаМаркера);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", Процесс.ВерсияСхемы);
	Запрос.УстановитьПараметр("Исключить", ТипыБезВхода());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭлементыСхем.Ссылка КАК Ссылка,
	|	ЭлементыСхем.Наименование КАК Наименование,
	|	ЭлементыСхем.ТипШага КАК ТипШага
	|ИЗ
	|	Справочник.кбп_ЭлементыСхем КАК ЭлементыСхем
	|ГДЕ
	|	ЭлементыСхем.Владелец = &Версия
	|	И НЕ ЭлементыСхем.ПометкаУдаления
	|	И НЕ ЭлементыСхем.НетНаСхеме
	|	И НЕ ЭлементыСхем.ТипШага В (&Исключить)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокШагов.Добавить(Выборка.Ссылка, СтрШаблон("%1 (%2)", Выборка.Наименование, Выборка.ТипШага));
	КонецЦикла;

	Состояния = Перечисления.кбп_СостоянияПроцессов;
	Элементы.ДействияПриостановить.Доступность = (Процесс.Состояние = Состояния.Активен);
	Элементы.ДействияПродолжить.Доступность = (Процесс.Состояние = Состояния.Приостановлен
		Или Процесс.Состояние = Состояния.Ошибка);
	МожноПереводить = (Процесс.Состояние = Состояния.Активен Или Процесс.Состояние = Состояния.Ошибка);
	Элементы.ДействияПерезапуститьШаг.Доступность = МожноПереводить И Маркеры.Количество() > 0;
	Элементы.ДействияПеревестиНаШаг.Доступность = МожноПереводить;

КонецПроцедуры

// Старт и варианты «Выбора варианта» — не шаги, в которые можно войти; декорации — не шаги.
&НаСервере
Функция ТипыБезВхода()

	Типы = Новый Массив;
	Типы.Добавить(Перечисления.кбп_ТипыШагов.Старт);
	Типы.Добавить(Перечисления.кбп_ТипыШагов.Вариант);
	Типы.Добавить(Перечисления.кбп_ТипыШагов.Декорация);
	Возврат Типы;

КонецФункции

&НаСервереБезКонтекста
Функция ВидыСписка()

	Виды = Новый Массив;
	Виды.Добавить(НСтр("ru = 'Требуют внимания'"));
	Виды.Добавить(НСтр("ru = 'С ошибками'"));
	Виды.Добавить(НСтр("ru = 'Зависшие'"));
	Виды.Добавить(НСтр("ru = 'Приостановленные'"));
	Виды.Добавить(НСтр("ru = 'Все незавершённые'"));
	Возврат Виды;

КонецФункции

&НаСервере
Процедура ОбновитьНаСервере()

	ЗагрузитьПроцессы();
	ЗагрузитьОшибкиДействий();
	ЗагрузитьОповещения();
	ОбновитьСостояниеЗаданий();
	Если ЗначениеЗаполнено(ТекущийПроцесс) И Процессы.НайтиСтроки(Новый Структура("Ссылка", ТекущийПроцесс)).Количество() = 0 Тогда
		ЗагрузитьВыбранныйПроцесс(Неопределено);
	ИначеЕсли Не ЗначениеЗаполнено(ТекущийПроцесс) Тогда
		ЗагрузитьВыбранныйПроцесс(Неопределено);
	КонецЕсли;

КонецПроцедуры

// Незавершённые процессы и признаки проблем (ФТ-804): ошибка, «зависание» (нет задач, ожидающих действий
// и активных вложенных процессов), приостановка.
&НаСервере
Процедура ЗагрузитьПроцессы()

	Состояния = Перечисления.кбп_СостоянияПроцессов;
	Активные = Новый Массив;
	Активные.Добавить(Состояния.Активен);
	Активные.Добавить(Состояния.Приостановлен);
	Активные.Добавить(Состояния.Ошибка);
	АктивныеЗадачи = Новый Массив;
	АктивныеЗадачи.Добавить(Перечисления.кбп_СостоянияЗадач.Ожидает);
	АктивныеЗадачи.Добавить(Перечисления.кбп_СостоянияЗадач.ВРаботе);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Активные", Активные);
	Запрос.УстановитьПараметр("АктивныеЗадачи", АктивныеЗадачи);
	Запрос.УстановитьПараметр("Схема", ОтборСхема);
	Запрос.УстановитьПараметр("ВсеСхемы", Не ЗначениеЗаполнено(ОтборСхема));
	Запрос.УстановитьПараметр("Ожидает", Перечисления.кбп_СтатусыОчереди.Ожидает);
	Запрос.УстановитьПараметр("Ошибка", Перечисления.кбп_СтатусыОчереди.Ошибка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Процессы.Ссылка КАК Ссылка,
	|	Процессы.Состояние КАК Состояние,
	|	Процессы.Автор КАК Автор,
	|	Процессы.ДатаСтарта КАК ДатаСтарта
	|ПОМЕСТИТЬ ВТПроцессы
	|ИЗ
	|	Справочник.кбп_Процессы КАК Процессы
	|ГДЕ
	|	Процессы.Состояние В (&Активные)
	|	И (&ВсеСхемы
	|			ИЛИ Процессы.Схема = &Схема)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Процессы.ДатаСтарта УБЫВ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Задачи.Процесс КАК Процесс,
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ПОМЕСТИТЬ ВТЗадачи
	|ИЗ
	|	Справочник.кбп_Задачи КАК Задачи
	|ГДЕ
	|	Задачи.Процесс В
	|			(ВЫБРАТЬ
	|				ВТПроцессы.Ссылка
	|			ИЗ
	|				ВТПроцессы)
	|	И Задачи.Состояние В (&АктивныеЗадачи)
	|	И НЕ Задачи.ЭтоКопия
	|
	|СГРУППИРОВАТЬ ПО
	|	Задачи.Процесс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Очередь.Процесс КАК Процесс,
	|	СУММА(ВЫБОР
	|			КОГДА Очередь.Статус = &Ожидает
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Ожидает,
	|	СУММА(ВЫБОР
	|			КОГДА Очередь.Статус = &Ошибка
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Ошибок
	|ПОМЕСТИТЬ ВТДействия
	|ИЗ
	|	РегистрСведений.кбп_ОчередьДействий КАК Очередь
	|ГДЕ
	|	Очередь.Процесс В
	|			(ВЫБРАТЬ
	|				ВТПроцессы.Ссылка
	|			ИЗ
	|				ВТПроцессы)
	|	И Очередь.Статус В (&Ожидает, &Ошибка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Очередь.Процесс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Дочерние.РодительскийПроцесс КАК Процесс,
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ПОМЕСТИТЬ ВТДочерние
	|ИЗ
	|	Справочник.кбп_Процессы КАК Дочерние
	|ГДЕ
	|	Дочерние.РодительскийПроцесс В
	|			(ВЫБРАТЬ
	|				ВТПроцессы.Ссылка
	|			ИЗ
	|				ВТПроцессы)
	|	И Дочерние.Состояние В (&Активные)
	|
	|СГРУППИРОВАТЬ ПО
	|	Дочерние.РодительскийПроцесс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПроцессы.Ссылка КАК Ссылка,
	|	ВТПроцессы.Состояние КАК Состояние,
	|	ВТПроцессы.Автор КАК Автор,
	|	ВТПроцессы.ДатаСтарта КАК ДатаСтарта,
	|	ВТПроцессы.Ссылка.ОписаниеОшибки КАК ОписаниеОшибки,
	|	ЕСТЬNULL(ВТЗадачи.Количество, 0) КАК Задач,
	|	ЕСТЬNULL(ВТДействия.Ожидает, 0) КАК Действий,
	|	ЕСТЬNULL(ВТДействия.Ошибок, 0) КАК Ошибок,
	|	ЕСТЬNULL(ВТДочерние.Количество, 0) КАК Дочерних
	|ИЗ
	|	ВТПроцессы КАК ВТПроцессы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗадачи КАК ВТЗадачи
	|		ПО ВТПроцессы.Ссылка = ВТЗадачи.Процесс
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДействия КАК ВТДействия
	|		ПО ВТПроцессы.Ссылка = ВТДействия.Процесс
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДочерние КАК ВТДочерние
	|		ПО ВТПроцессы.Ссылка = ВТДочерние.Процесс
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСтарта УБЫВ";

	Виды = ВидыСписка();
	Процессы.Очистить();
	ТребуютВнимания = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СОшибкой = (Выборка.Состояние = Состояния.Ошибка Или Выборка.Ошибок > 0);
		Завис = (Выборка.Состояние = Состояния.Активен И Выборка.Задач = 0 И Выборка.Действий = 0
			И Выборка.Дочерних = 0);
		Приостановлен = (Выборка.Состояние = Состояния.Приостановлен);
		Если СОшибкой Или Завис Тогда
			ТребуютВнимания = ТребуютВнимания + 1;
		КонецЕсли;
		Если ВидСписка = Виды[0] И Не СОшибкой И Не Завис
			Или ВидСписка = Виды[1] И Не СОшибкой
			Или ВидСписка = Виды[2] И Не Завис
			Или ВидСписка = Виды[3] И Не Приостановлен Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Процессы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если СОшибкой Тогда
			НоваяСтрока.Проблема = ?(ЗначениеЗаполнено(Выборка.ОписаниеОшибки), Выборка.ОписаниеОшибки,
				СтрШаблон(НСтр("ru = 'действий с ошибкой: %1'"), Выборка.Ошибок));
		ИначеЕсли Завис Тогда
			НоваяСтрока.Проблема = НСтр("ru = 'завис: нет задач, ожидающих действий и вложенных процессов'");
		ИначеЕсли Приостановлен Тогда
			НоваяСтрока.Проблема = НСтр("ru = 'приостановлен'");
		Иначе
			НоваяСтрока.Проблема = СтрШаблон(НСтр("ru = 'задач: %1'"), Выборка.Задач);
		КонецЕсли;
	КонецЦикла;
	ЗаголовокПроцессов = ?(ТребуютВнимания = 0, НСтр("ru = 'Процессы'"),
		СтрШаблон(НСтр("ru = 'Процессы (%1)'"), ТребуютВнимания));

КонецПроцедуры

#КонецОбласти

#Область ОчередьДействий

&НаКлиенте
Процедура ИзменитьДействие(Повторить)

	ТекущиеДанные = Элементы.ОшибкиДействий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ошибка = ИзменитьДействиеНаСервере(ТекущиеДанные.Ид, Повторить);
	Если ЗначениеЗаполнено(Ошибка) Тогда
		ПоказатьПредупреждение(, Ошибка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ИзменитьДействиеНаСервере(Ид, Повторить)

	Ошибка = "";
	Попытка
		Если Повторить Тогда
			кбп_Движок.ПовторитьДействие(Ид, Комментарий);
		Иначе
			кбп_Движок.ОтменитьДействие(Ид);
		КонецЕсли;
	Исключение
		Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	ОбновитьНаСервере();
	Возврат Ошибка;

КонецФункции

// Журнал ошибок движка (ФТ-905): действия очереди со статусом «Ошибка» и, по флажку, ожидающие повтора.
&НаСервере
Процедура ЗагрузитьОшибкиДействий()

	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.кбп_СтатусыОчереди.Ошибка);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Статусы", Статусы);
	Запрос.УстановитьПараметр("Ожидает", Перечисления.кбп_СтатусыОчереди.Ожидает);
	Запрос.УстановитьПараметр("СОжидающими", ПоказыватьОжидающие);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 500
	|	Очередь.Ид КАК Ид,
	|	Очередь.Вид КАК Вид,
	|	Очередь.Процесс КАК Процесс,
	|	Очередь.ПоследняяОшибка КАК ПоследняяОшибка,
	|	Очередь.Попыток КАК Попыток,
	|	Очередь.Статус КАК Статус,
	|	Очередь.ВыполнитьПосле КАК ВыполнитьПосле
	|ИЗ
	|	РегистрСведений.кбп_ОчередьДействий КАК Очередь
	|ГДЕ
	|	(Очередь.Статус В (&Статусы)
	|			ИЛИ &СОжидающими
	|				И Очередь.Статус = &Ожидает
	|				И Очередь.Попыток > 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Очередь.ВыполнитьПосле УБЫВ";
	ОшибкиДействий.Загрузить(Запрос.Выполнить().Выгрузить());
	ЧислоОшибок = ОшибкиДействий.НайтиСтроки(Новый Структура("Статус", Перечисления.кбп_СтатусыОчереди.Ошибка)).Количество();
	ЗаголовокОшибок = ?(ЧислоОшибок = 0, НСтр("ru = 'Ошибки действий'"),
		СтрШаблон(НСтр("ru = 'Ошибки действий (%1)'"), ЧислоОшибок));

КонецПроцедуры

#КонецОбласти

#Область ОчередьОповещений

&НаКлиенте
Процедура ИзменитьОчередьОповещений(Повторить)

	Идентификаторы = Новый Массив;
	Для Каждого Идентификатор Из Элементы.Оповещения.ВыделенныеСтроки Цикл
		Идентификаторы.Добавить(Оповещения.НайтиПоИдентификатору(Идентификатор).Ид);
	КонецЦикла;
	Если Идентификаторы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Изменено = ИзменитьОчередьНаСервере(Идентификаторы, Повторить);
	ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru = 'Изменено сообщений: %1'"), Изменено));

КонецПроцедуры

&НаСервере
Функция ИзменитьОчередьНаСервере(Идентификаторы, Повторить)

	Изменено = кбп_Оповещения.ИзменитьОчередь(Идентификаторы, Повторить);
	ЗагрузитьОповещения();
	Возврат Изменено;

КонецФункции

&НаСервере
Процедура ОтправитьОчередьНаСервере()

	кбп_Оповещения.ОтправитьОчередь();
	ЗагрузитьОповещения();

КонецПроцедуры

// Очередь оповещений (ФТ-804, ФТ-606).
&НаСервере
Процедура ЗагрузитьОповещения()

	Статусы = Перечисления.кбп_СтатусыОчереди;
	Отбор = Новый Массив;
	Если ОтборОповещений = "Ошибки" Тогда
		Отбор.Добавить(Статусы.Ошибка);
	ИначеЕсли ОтборОповещений = "НеОтправлено" Тогда
		Отбор.Добавить(Статусы.Ожидает);
		Отбор.Добавить(Статусы.ОжидаетГруппировки);
		Отбор.Добавить(Статусы.Выполняется);
		Отбор.Добавить(Статусы.Ошибка);
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Статусы", Отбор);
	Запрос.УстановитьПараметр("ВсеСтатусы", Отбор.Количество() = 0);
	Запрос.УстановитьПараметр("Сутки", ТекущаяДатаСеанса() - 86400);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 500
	|	Очередь.Ид КАК Ид,
	|	Очередь.ДатаСоздания КАК ДатаСоздания,
	|	Очередь.Канал КАК Канал,
	|	Очередь.Получатель КАК Получатель,
	|	Очередь.Адрес КАК Адрес,
	|	Очередь.Тема КАК Тема,
	|	Очередь.Статус КАК Статус,
	|	Очередь.Попыток КАК Попыток,
	|	Очередь.Ошибка КАК Ошибка,
	|	Очередь.Процесс КАК Процесс,
	|	Очередь.Задача КАК Задача
	|ИЗ
	|	РегистрСведений.кбп_ОчередьОповещений КАК Очередь
	|ГДЕ
	|	(&ВсеСтатусы
	|				И Очередь.ДатаСоздания >= &Сутки
	|			ИЛИ Очередь.Статус В (&Статусы))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Очередь.ДатаСоздания УБЫВ";
	Оповещения.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Оповещения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Кому = ?(ЗначениеЗаполнено(Выборка.Получатель), Строка(Выборка.Получатель), Выборка.Адрес);
	КонецЦикла;

	Запрос.УстановитьПараметр("Ошибка", Статусы.Ошибка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	РегистрСведений.кбп_ОчередьОповещений КАК Очередь
	|ГДЕ
	|	Очередь.Статус = &Ошибка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ЗаголовокОповещений = ?(Выборка.Количество = 0, НСтр("ru = 'Очередь оповещений'"),
		СтрШаблон(НСтр("ru = 'Очередь оповещений (%1)'"), Выборка.Количество));

КонецПроцедуры

#КонецОбласти

#Область Настройки

// Настройки продукта (ФТ-904) и рассылок (ФТ-605) из регистра кбп_Настройки.
&НаСервере
Процедура ПрочитатьНастройки()

	Для Каждого Ключ Из КлючиНастроек() Цикл
		Значение = кбп_ПроцессыСлужебный.Настройка(Ключ);
		Если Значение <> Неопределено Тогда
			ЭтотОбъект[Ключ] = Значение;
		КонецЕсли;
	КонецЦикла;
	Если Не ЗначениеЗаполнено(ПроизводственныйКалендарь) Тогда
		ПроизводственныйКалендарь = Неопределено;
	КонецЕсли;
	УстановитьДоступностьРассылокФормы(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиНаСервере()

	Для Каждого Ключ Из КлючиНастроек() Цикл
		Значение = ЭтотОбъект[Ключ];
		кбп_ПроцессыСлужебный.УстановитьНастройку(Ключ, ?(ЗначениеЗаполнено(Значение) Или ТипЗнч(Значение) = Тип("Булево")
			Или ТипЗнч(Значение) = Тип("Число"), Значение, Неопределено));
	КонецЦикла;
	кбп_ПроцессыСлужебный.ПриИзмененииНастроекРассылок();

КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючиНастроек()

	Возврат СтрРазделить("МаксимальнаяГлубинаВложенности,СрокХраненияЖурналаДней,АдминистраторПроцессов,"
		+ "ПроизводственныйКалендарь,НачалоРабочегоДня,ОкончаниеРабочегоДня,КаналыПоУмолчанию,ОтправлятьПочту,"
		+ "СводкаЗадач,ЧасСводки,ОтчетОПросрочках,ЧасОтчета,РольПолучателейОтчета,РассылкиПоРабочимДням", ",");

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьРассылокФормы(Форма)

	Форма.Элементы.ЧасСводки.Доступность = Форма.СводкаЗадач;
	Форма.Элементы.ЧасОтчета.Доступность = Форма.ОтчетОПросрочках;
	Форма.Элементы.РольПолучателейОтчета.Доступность = Форма.ОтчетОПросрочках;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРассылок()
	УстановитьДоступностьРассылокФормы(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеЗаданий()

	Строки = Новый Массив;
	Выключены = 0;
	Для Каждого Задание Из кбп_АдаптерКонфигурации.СостояниеРегламентныхЗаданий() Цикл
		Если Не Задание.Использование Тогда
			Выключены = Выключены + 1;
			Строки.Добавить(СтрШаблон(НСтр("ru = '%1: выключено'"), Задание.Представление));
		ИначеЕсли ЗначениеЗаполнено(Задание.ОшибкаПоследнегоЗапуска) Тогда
			Строки.Добавить(СтрШаблон(НСтр("ru = '%1: ошибка при запуске %2 — %3'"), Задание.Представление,
				Задание.ПоследнийЗапуск, Задание.ОшибкаПоследнегоЗапуска));
		ИначеЕсли ЗначениеЗаполнено(Задание.ПоследнийЗапуск) Тогда
			Строки.Добавить(СтрШаблон(НСтр("ru = '%1: последний запуск %2'"), Задание.Представление,
				Задание.ПоследнийЗапуск));
		Иначе
			Строки.Добавить(СтрШаблон(НСтр("ru = '%1: ещё не запускалось'"), Задание.Представление));
		КонецЕсли;
	КонецЦикла;
	СостояниеЗаданий = СтрСоединить(Строки, Символы.ПС);
	Элементы.ВключитьЗаданияКнопка.Видимость = Выключены > 0;

КонецПроцедуры

&НаСервере
Функция ОтправитьРассылкиНаСервере()

	ЗаписатьНастройкиНаСервере();
	Отправлено = кбп_Оповещения.ВыполнитьРассылки(Истина);
	кбп_Оповещения.ОтправитьОчередь();
	ЗагрузитьОповещения();
	Возврат Отправлено;

КонецФункции

&НаСервере
Процедура ВключитьЗаданияНаСервере()

	кбп_АдаптерКонфигурации.ВключитьРегламентныеЗадания();
	ОбновитьСостояниеЗаданий();

КонецПроцедуры

#КонецОбласти

#КонецОбласти
